
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	РаботаСДокументамиКлиент.РасчитатьСуммуСтоимостиТовара(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	РаботаСДокументамиКлиент.РасчитатьСуммуСтоимостиТовара(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);
	ОткрытьФорму("Справочник.Товары.ФормаВыбора", ПараметрыФормы
	, Элементы.Товары);
КонецПроцедуры

&НаКлиенте
Асинх Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Перем ОтветПередДобавлением;
	Если ОтветПередДобавлением <> Истина Тогда
		СтандартнаяОбработка = Ложь;
		Результат = Ждать ВопросАсинх("Добавить номенклатуру в табличную часть?", РежимДиалогаВопрос.ДаНет);
		Если Результат = КодВозвратаДиалога.Да Тогда
			ОтветПередДобавлением = Истина;
			Для Каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл
				НоваяСтрока = Объект.Товары.Добавить();
				НоваяСтрока.Товар = ВыбранныйЭлемент;
			КонецЦикла;
		КонецЕсли;	
	Иначе
		Для Каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.Товары.Добавить();
			НоваяСтрока.Товар = ВыбранныйЭлемент;
		КонецЦикла;
	КонецЕсли

КонецПроцедуры
