
&НаКлиенте
Процедура ПолучитьДанныеСБазыСервера(Команда)
	АссинхронноПолучитьДанные();
КонецПроцедуры

&НаКлиенте
Асинх Процедура АссинхронноПолучитьДанные()
	СерверИсточник = "Localhost";
	Адрес = "/kbserver/hs/root/tovari/" + Объект.Код;
	HTTPЗапрос = Новый HTTPЗапрос(Адрес);
	
	HTTP = Новый HTTPСоединение(СерверИсточник,,"Администратор",,,5);
	HTTPОтветОбещанный = HTTP.ПолучитьАсинх(HTTPЗапрос);
	Попытка
	HTTPОтвет = Ждать HTTPОтветОбещанный;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сработало исключение";
		Сообщение.Сообщить();
	КонецПопытки;
	Если HTTPОтвет.КодСостояния = 200 Тогда
		ТелоСтроки = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(ТелоСтроки);
		Данные = ПрочитатьJSON(Чтение, Ложь);
		Чтение.Закрыть();
		
		Объект.Наименование = Данные.Товар;
		ПолучитьПеречисления(Данные.ВидТовара);
		Сообщение.Текст = "Данные о товаре получены с сервера";
		Сообщение.Сообщить();
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка, код состояния " + HTTPОтвет.КодСостояния;
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьПеречисления(Данные)
	Если Данные = "Продукт питания" Тогда 
		Объект.ВидТовара = Перечисления.ВидыТоваров.ПродуктПитания;
	ИначеЕсли Данные = "Бытовая техника" Тогда
		Объект.ВидТовара = Перечисления.ВидыТоваров.БытоваяТехника;
	ИначеЕсли Данные = "Одноразовый товар" Тогда
		Объект.ВидТовара = Перечисления.ВидыТоваров.ОдноразовыйТовар;
	ИначеЕсли Данные = "Одежда" Тогда
		Объект.ВидТовара = Перечисления.ВидыТоваров.Одежда;
	ИначеЕсли Данные = "Электроника" Тогда
		Объект.ВидТовара = Перечисления.ВидыТоваров.Электроника;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанныеНаБазуСервера(Команда)
	СозданиеДанных();
КонецПроцедуры

&НаКлиенте
Асинх Процедура СозданиеДанных()
	ПараметрыJson = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJson = Новый ЗаписьJSON;
	ЗаписьJson.УстановитьСтроку(ПараметрыJson);
	
	СтруктураТовара = Новый Структура("Code, Name, Vid", Объект.Код, Объект.Наименование,
	Строка(Объект.ВидТовара));
	ЗаписатьJSON(ЗаписьJson, СтруктураТовара);
	ЗаписьТовара = ЗаписьJson.Закрыть();
	
	СерверИсточник = "Localhost";
	Адрес = "/kbserver/hs/root/tovari/" + Объект.Код;
	HTTPЗапрос = Новый HTTPЗапрос(Адрес);
	HTTP = Новый HTTPСоединение(СерверИсточник,,"Администратор",,,5);
	HTTPЗапрос.УстановитьТелоИзСтроки(ЗаписьТовара);
	Попытка
		Ответ = Ждать HTTP.ОтправитьДляОбработкиАсинх(HTTPЗапрос);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сработало исключение";
		Сообщение.Сообщить();
	КонецПопытки;
	
	Если Ответ = 201 Тогда	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Создан товар на базе данных сервере";
		Сообщение.Сообщить();
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка, код состояния " + Ответ.КодСостояния;
		Сообщение.Сообщить();
	КонецЕсли;	
КонецПроцедуры