
Функция ТоварыGet(Запрос)
	ЗапросЧтение = Новый Запрос;
	ЗапросЧтение.Текст = 
	"ВЫБРАТЬ
	|	Товары.Наименование КАК Наименование,
	|	ПРЕДСТАВЛЕНИЕ(Товары.ВидТовара) КАК ВидТовара
	|ИЗ
	|	Справочник.Товары КАК Товары
	|ГДЕ
	|	Товары.Код = &Код";
	ЗапросЧтение.УстановитьПараметр("Код", Запрос.ПараметрыURL["Code"]);
	
	РезультатЗапроса = ЗапросЧтение.Выполнить();
	ВыборкаТовары = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаТовары.Следующий() Цикл
		СтруктураТовара = Новый Структура;
		СтруктураТовара.Вставить("Товар", ВыборкаТовары.Наименование);
		СтруктураТовара.Вставить("ВидТовара", ВыборкаТовары.ВидТовара);
	КонецЦикла; 
	ПараметрыJson = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJson = Новый ЗаписьJSON;
	ЗаписьJson.УстановитьСтроку(ПараметрыJson);
	ЗаписатьJSON(ЗаписьJson, СтруктураТовара);
	ЗаписьТовара = ЗаписьJson.Закрыть();
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ЗаписьТовара);
	Ответ.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
	Возврат Ответ;
КонецФункции

Функция ТоварыСоздатьТовар(Запрос)
	Ответ = Новый HTTPСервисОтвет(201);
	Чтение = Новый ЧтениеJSON;
	Путь = Константы.ПутьКБазеДанных.Получить() + "\";
	Чтение.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку("UTF-8"));
	
	Данные = ПрочитатьJSON(Чтение, Ложь);
	Чтение.Закрыть();
	НовыйЭлемент = Справочники.Товары.СоздатьЭлемент();
	НовыйЭлемент.Код = Данные.Code;
	НовыйЭлемент.Наименование = Данные.Name;
	Если Данные.Vid = "Продукт питания" Тогда 
		НовыйЭлемент.ВидТовара = Перечисления.ВидыТоваров.ПродуктПитания;
	ИначеЕсли Данные.Vid = "Бытовая техника" Тогда
		НовыйЭлемент.ВидТовара = Перечисления.ВидыТоваров.БытоваяТехника;
	ИначеЕсли Данные.Vid = "Одноразовый товар" Тогда
		НовыйЭлемент.ВидТовара = Перечисления.ВидыТоваров.ОдноразовыйТовар;
	ИначеЕсли Данные.Vid = "Одежда" Тогда
		НовыйЭлемент.ВидТовара = Перечисления.ВидыТоваров.Одежда;
	ИначеЕсли Данные.Vid = "Электроника" Тогда
		НовыйЭлемент.ВидТовара = Перечисления.ВидыТоваров.Электроника;
	КонецЕсли;
	НовыйЭлемент.Записать();
	Чтение.УстановитьСтроку(Строка(НовыйЭлемент.Ссылка.УникальныйИдентификатор()));	
	Возврат Ответ;
КонецФункции


