
&НаСервере
Процедура Команда1НаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Реализация.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Реализация КАК Реализация
		|ГДЕ
		|	Реализация.Проведен
		|	И Реализация.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущаяДатаСеанса()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДокументЗакрытия = РезультатЗапроса.Выбрать();
	
	Пока ДокументЗакрытия.Следующий() Цикл
		Реализация = ДокументЗакрытия.Ссылка.ПолучитьОбъект();
		Реализация.Завершен = Истина;
		Реализация.Записать(РежимЗаписиДокумента.Запись);
	КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры


&НаСервере
Процедура ОбновитьТоварыБезДвиженияНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыБезДвижения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТоварыБезДвижения КАК ТоварыБезДвижения";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбновления = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаОбновления.Следующий() Цикл
		СправочникКУдалению = ВыборкаОбновления.Ссылка.ПолучитьОбъект();
		СправочникКУдалению.Удалить();
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(ОстаткиТоваров.Товар КАК Справочник.Товары).Наименование КАК Наименование
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров КАК ОстаткиТоваров";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗапись = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаЗапись.Следующий() Цикл
		НоваяЗапись = Справочники.ТоварыБезДвижения.СоздатьЭлемент();
		НоваяЗапись.Наименование = ВыборкаЗапись.Наименование;
	    НоваяЗапись.УстановитьНовыйКод();
		НоваяЗапись.Записать();
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ОбновитьТоварыБезДвижения(Команда)
	ОбновитьТоварыБезДвиженияНаСервере();
КонецПроцедуры
   