
Процедура ОбработкаПроведения(Отказ, Режим)
    Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТовары.Товар КАК Товар,
		|	СУММА(РеализацияТовары.Количество) КАК Количество,
		|	СУММА(РеализацияТовары.Сумма) КАК Сумма
		|ИЗ
		|	Документ.Реализация.Товары КАК РеализацияТовары
		|ГДЕ
		|	РеализацияТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТовары.Товар";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Товар = ВыборкаДетальныеЗаписи.Товар;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Товар = ВыборкаДетальныеЗаписи.Товар;
		Движение.Покупатель = Покупатель; 
		Движение.Выручка = ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;
	Движения.ОстаткиТоваров.БлокироватьДляИзменения = Истина;
   	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ОстаткиТоваровОстатки.Товар) КАК ТоварП,
	|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОст
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваров.Остатки(
	|			&Период,
	|			Товар В (&СписокНоменклатуры)
	|				И Склад = &Склад) КАК ОстаткиТоваровОстатки
	|ГДЕ
	|	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
	Запрос.Параметры.Вставить("Период", Новый Граница(МоментВремени()));
	Запрос.Параметры.Вставить("СписокНоменклатуры", Товары.ВыгрузитьКолонку("Товар"));
	Запрос.Параметры.Вставить("Склад", Склад);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не хватает товара " + ВыборкаДетальныеЗаписи.ТоварП + 
		" в количестве " +  -ВыборкаДетальныеЗаписи.КоличествоОст;
		Сообщение.Сообщить();
		Отказ = Истина;
		Продолжить;
	КонецЦикла;
	
КонецПроцедуры
