
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр УчетнаяПолитика
	Движения.УчетнаяПолитика.Записывать = Истина;
	Движение = Движения.УчетнаяПолитика.Добавить();
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.МетодСписания = МетодСписания;
	
	// регистр ОстаткиТоваров Приход
	Если МетодСписания = Перечисления.УчетнаяПолитика.ПоСредней Тогда
		Движения.ОстаткиТоваров.Записывать = Истина;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Товар КАК Товар,
		|	ОстаткиТоваровОстатки.Склад КАК Склад,
		|	ОстаткиТоваровОстатки.Партия КАК Партия,
		|	ОстаткиТоваровОстатки.Организация КАК Организация,
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК Количество,
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.СуммаОстаток, 0) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(&МоментВремени, Организация = &Организация) КАК ОстаткиТоваровОстатки
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(Сумма)
		|ПО
		|	Товар,
		|	Склад";
		
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
		Запрос.УстановитьПараметр("Организация", Организация);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаТовар = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаТовар.Следующий() Цикл
			
			ВыборкаСклад = ВыборкаТовар.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаСклад.Следующий() Цикл
				Движение = Движения.ОстаткиТоваров.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Товар = ВыборкаТовар.Товар;
				Движение.Склад = ВыборкаСклад.Склад;
				Движение.Партия = Ссылка;
				Движение.Организация = Организация;
				Движение.Количество = ВыборкаСклад.Количество;
				Движение.Сумма = ВыборкаСклад.Сумма;
				
				Выборка = ВыборкаСклад.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					Движение = Движения.ОстаткиТоваров.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.Товар = ВыборкаТовар.Товар;
					Движение.Склад = ВыборкаСклад.Склад;
					Движение.Партия = Выборка.Партия;
					Движение.Организация = Организация;
					Движение.Количество = Выборка.Количество;
					Движение.Сумма = Выборка.Сумма;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры
