
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	РаботаСДокументамиКлиент.РасчитатьСуммуСтоимостиТовара(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	РаботаСДокументамиКлиент.РасчитатьСуммуСтоимостиТовара(СтрокаТабличнойЧасти);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Завершен = Истина Тогда
		ЭтаФорма.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

         