
Процедура ОбработкаПроведения(Отказ, Режим)
	Отбор = Новый Структура("Организация", Организация);
	МетодСписания = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата, Отбор).МетодСписания;
	Если Не ЗначениеЗаполнено(МетодСписания) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не установлена учетная политика";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ОстаткиТоваров.Записать();
	Движения.Продажи.Записывать = Истина;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТоваров");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
	ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Товар", "Товар");
	Блокировка.Заблокировать();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТовары.Товар КАК Товар,
		|	СУММА(РеализацияТовары.Количество) КАК Количество,
		|	СУММА(РеализацияТовары.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	Документ.Реализация.Товары КАК РеализацияТовары
		|ГДЕ
		|	РеализацияТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТовары.Товар
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Товар КАК Товар,
		|	ВТ_Товары.Количество КАК КоличествоДокумент,
		|	ВТ_Товары.Сумма КАК СуммаДокумент,
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ПРЕДСТАВЛЕНИЕ(ВТ_Товары.Товар) КАК ТоварПредставление,
		|	ОстаткиТоваровОстатки.Партия КАК Партия
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(
		|				&МоментВремени,
		|				Товар В
		|						(ВЫБРАТЬ
		|							ВТ_Товары.Товар КАК Товар
		|						ИЗ
		|							ВТ_Товары КАК ВТ_Товары)
		|					И Склад = &Склад
		|					И Организация = &Организация) КАК ОстаткиТоваровОстатки
		|		ПО ВТ_Товары.Товар = ОстаткиТоваровОстатки.Товар
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОстаткиТоваровОстатки.Партия.МоментВремени УБЫВ
		|ИТОГИ
		|	МАКСИМУМ(КоличествоДокумент),
		|	МАКСИМУМ(СуммаДокумент),
		|	СУММА(КоличествоОстаток)
		|ПО
		|	Товар";
	Если МетодСписания = Перечисления.УчетнаяПолитика.ФИФО Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "УБЫВ", "");
	КонецЕсли;
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТовар = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТовар.Следующий() Цикл
		Себестоимость = 0;
		Если ВыборкаТовар.КоличествоДокумент > ВыборкаТовар.КоличествоОстаток Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Недостаточно товара " + ВыборкаТовар.ТоварПредставление + 
			" в количестве " + (ВыборкаТовар.КоличествоДокумент - ВыборкаТовар.КоличествоОстаток);
			Сообщение.Сообщить();
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		Если Не Отказ Тогда
			КСписанию = ВыборкаТовар.КоличествоДокумент;
			Выборка = ВыборкаТовар.Выбрать();	
			Пока Выборка.Следующий() И КСписанию > 0 Цикл
				Списание = Мин(КСписанию, Выборка.КоличествоОстаток);
				Стоимость = ?(КСписанию = Выборка.КоличествоОстаток, Выборка.СуммаОстаток,
				Выборка.СуммаОстаток / Выборка.КоличествоОстаток * Списание);
				КСписанию = КСписанию - Списание;
				Движение = Движения.ОстаткиТоваров.ДобавитьРасход();
				Движение.Период = Дата;
				Движение.Склад = Склад;
				Движение.Партия = Выборка.Партия;
				Движение.Организация = Организация;
				Движение.Товар = ВыборкаТовар.Товар;
				Движение.Сумма = Стоимость;
				Движение.Количество = Списание;
				Себестоимость = Себестоимость + Стоимость;
			КонецЦикла;
			
			Движение = Движения.Продажи.Добавить();
			Движение.Период = Дата;
			Движение.Товар = ВыборкаТовар.Товар;
			Движение.Количество = ВыборкаТовар.КоличествоДокумент;
			Движение.Себестоимость = Себестоимость;
			Движение.Выручка = ВыборкаТовар.СуммаДокумент;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если (РежимЗаписи = РежимЗаписиДокумента.Проведение Или
		РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) И Завершен = Истина Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Месяц закрыт документ не будет перезаписан";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
